# Kind Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallType..::..Kind Property
WallType Class See Also
---
The nature of the wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WallKind Kind { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Kind As WallKind
	Get
```

Visual C++
---
```text
public:
property WallKind Kind {
	WallKind get ();
}
```

# See Also
WallType Class
Autodesk.Revit.DB Namespace